Sales Data

Important libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [2]:
sale_data = pd.read_csv('C:/Users/ACER/Downloads/Data sparking/Sales.csv')
sale_data.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [3]:
sale_data.shape

(62884, 9)

In [4]:
sale_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

Checking Null Values

In [5]:
sale_data.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

Dropping the Null column

In [6]:
sale_data.drop(['Delivery Date'], inplace = True, axis = 1)

In [7]:
sale_data.head()

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,266019,0,373,1,CAD

In [8]:
sale_data.tail()

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
62879,2243030,1,2/20/2021,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,331277,0,464,7,CAD

Checking Duplicates values

In [9]:
print(sale_data.duplicated().sum())

0

In [10]:
#checking datatypes
print(sale_data.dtypes)

Order Number      int64
Line Item         int64
Order Date       object
CustomerKey       int64
StoreKey          int64
ProductKey        int64
Quantity          int64
Currency Code    object
dtype: object

Here converting the Order Date of data type, because it is in an object so converting into an datetime datatype

In [11]:


# Assuming 'sale_data' is your DataFrame and 'Order Date' is the column with datetime strings
sale_data['Order Date'] = pd.to_datetime(sale_data['Order Date'], format='%m/%d/%Y', errors='coerce')

# Convert to date format only (YYYY-MM-DD)
sale_data['Order Date'] = sale_data['Order Date'].dt.date

print(sale_data.dtypes)

Order Number      int64
Line Item         int64
Order Date       object
CustomerKey       int64
StoreKey          int64
ProductKey        int64
Quantity          int64
Currency Code    object
dtype: object

In [12]:
sale_data.head()

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD
2,366001,2,2016-01-01,1269051,0,2007,1,USD
3,366002,1,2016-01-01,266019,0,1106,7,CAD
4,366002,2,2016-01-01,266019,0,373,1,CAD

In [15]:
# Save the cleaned data to a new CSV file
sale_data.to_excel('Sale_processed.xlsx', index=False)
print("Cleaned dataset saved to Sales_processed.xlsx")

Cleaned dataset saved to Sales_processed.xlsx

Product Data

In [16]:
prod_data = pd.read_csv('C:/Users/ACER/Downloads/Data sparking/Products.csv')
prod_data.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [17]:
prod_data.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [18]:
print(prod_data.duplicated().sum())

0

Here converting the unit cost USD & unit price USD to numeric

In [19]:
prod_data['Unit Cost USD'] = prod_data['Unit Cost USD'].replace({'\$': ''}, regex=True)
prod_data['Unit Cost USD'] = pd.to_numeric(prod_data['Unit Cost USD'], errors='coerce')

prod_data['Unit Price USD'] = prod_data['Unit Price USD'].replace({'\$': ''}, regex=True)
prod_data['Unit Price USD'] = pd.to_numeric(prod_data['Unit Price USD'], errors='coerce')

In [20]:
print(prod_data['Unit Cost USD'].head())
print(prod_data['Unit Price USD'].head())

0     6.62
1     6.62
2     7.40
3    11.00
4    11.00
Name: Unit Cost USD, dtype: float64
0    12.99
1    12.99
2    14.52
3    21.57
4    21.57
Name: Unit Price USD, dtype: float64

In [ ]:
prod_data.head()

In [21]:
# Save the cleaned data to a new CSV file
prod_data.to_excel('Products_processed.xlsx', index=False)
print("Cleaned dataset saved to Products_processed.xlsx")

Cleaned dataset saved to Products_processed.xlsx

Stores

In [22]:
store_data = pd.read_csv('C:/Users/ACER/Downloads/Data sparking/Stores.csv')
store_data.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [23]:
store_data.tail()

    StoreKey        Country          State  Square Meters Open Date
62        63  United States           Utah         2000.0  3/6/2008
63        64  United States  Washington DC         1330.0  1/1/2010
64        65  United States  West Virginia         1785.0  1/1/2012
65        66  United States        Wyoming          840.0  1/1/2014
66         0         Online         Online            NaN  1/1/2010

In [24]:
store_data.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [25]:
store_data['Square Meters']

0      595.0
1      665.0
2     2000.0
3     2000.0
4     2000.0
       ...
62    2000.0
63    1330.0
64    1785.0
65     840.0
66       NaN
Name: Square Meters, Length: 67, dtype: float64

It shows the 66 row only has an null value, so that we going to remove the row

In [26]:
# Remove row with index 3 in-place
store_data.drop(index=66, inplace=True)

In [27]:
store_data.tail()

    StoreKey        Country          State  Square Meters Open Date
61        62  United States   South Dakota         1120.0  6/3/2018
62        63  United States           Utah         2000.0  3/6/2008
63        64  United States  Washington DC         1330.0  1/1/2010
64        65  United States  West Virginia         1785.0  1/1/2012
65        66  United States        Wyoming          840.0  1/1/2014

In [28]:
store_data.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    0
Open Date        0
dtype: int64

In [29]:
store_data.dtypes

StoreKey           int64
Country           object
State             object
Square Meters    float64
Open Date         object
dtype: object

In [30]:
store_data.duplicated().sum()

0

Converting the Open date columns  into an datetime datatype because it is an object datatype

In [31]:

# Assuming 'sale_data' is your DataFrame and 'Order Date' is the column with datetime strings
store_data['Open Date'] = pd.to_datetime(store_data['Open Date'], format='%m/%d/%Y', errors='coerce')

# Convert to date format only (YYYY-MM-DD)
store_data['Open Date'] = store_data['Open Date'].dt.date

print(store_data.dtypes)

StoreKey           int64
Country           object
State             object
Square Meters    float64
Open Date         object
dtype: object

In [32]:
# Save the cleaned data to a new CSV file
store_data.to_excel('Stores_processed.xlsx', index=False)
print("Cleaned dataset saved to Stores_processed.xlsx")

Cleaned dataset saved to Stores_processed.xlsx

Exchange Rates

In [33]:
exch_data = pd.read_csv('C:/Users/ACER/Downloads/Data sparking/Exchange_rates.csv')
exch_data.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [34]:
exch_data.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [35]:
exch_data.duplicated().sum()

0

In [36]:
exch_data.dtypes

Date         object
Currency     object
Exchange    float64
dtype: object

Converting the Date columns  into an datetime datatype because it is an object datatype

In [37]:

exch_data['Date'] = pd.to_datetime(exch_data['Date'], format='%m/%d/%Y', errors='coerce')

# Convert to date format only (YYYY-MM-DD)
exch_data['Date'] = exch_data['Date'].dt.date

print(exch_data.dtypes)

Date         object
Currency     object
Exchange    float64
dtype: object

In [38]:
exch_data.head()

         Date Currency  Exchange
0  2015-01-01      USD    1.0000
1  2015-01-01      CAD    1.1583
2  2015-01-01      AUD    1.2214
3  2015-01-01      EUR    0.8237
4  2015-01-01      GBP    0.6415

In [39]:
# Save the cleaned data to a new CSV file
exch_data.to_excel('Exchange_Rates_processed.xlsx', index=False)
print("Cleaned dataset saved to Exchange_Rates_processed.xlsx")

Cleaned dataset saved to Exchange_Rates_processed.xlsx

Customers

In [40]:
cust_data = pd.read_csv('C:/Users/ACER/Downloads/Data sparking/Customers.csv', encoding = 'latin-1')
cust_data.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [41]:
cust_data.shape

(15266, 10)

In [42]:
cust_data.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In here we remove all rows where the column 'State Code' contains NaN values

In [43]:
cust_data.dropna(subset=['State Code'], inplace=True)

In [44]:
cust_data.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [45]:
cust_data.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [46]:
cust_data.duplicated().sum()

0

In [47]:
cust_data.dtypes

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [48]:
cust_data['Birthday'] = pd.to_datetime(cust_data['Birthday'], format='%m/%d/%Y', errors='coerce')

# Convert to date format only (YYYY-MM-DD)
cust_data['Birthday'] = cust_data['Birthday'].dt.date

print(cust_data.dtypes)

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [49]:
# Save the cleaned data to a new CSV file
cust_data.to_excel('Customers_processed.xlsx', index=False)
print("Cleaned dataset saved to Customers_processed.xlsx")

Cleaned dataset saved to Customers_processed.xlsx

Connecting the files(Processed data) in a SQL

In [ ]:
pip install pandas mysql-connector-python openpyxl

Connecting the excel file into an SQL file for(Sales_processed)

In [18]:
import mysql.connector
import pandas as pd

# Load data (adjust the file path and name as needed)
data_df = pd.read_excel('Sale_processed.xlsx')

# MySQL connection details
conn = mysql.connector.connect(
    host='127.0.0.1',
    user='root',
    password='Abdul@1973',
    database='Dataspark'  # Use the correct database name
)
cursor = conn.cursor()

# Create the table with backticks for column names with spaces
create_table_query = '''
CREATE TABLE IF NOT EXISTS sales1 (
    `Order Number` INT,
    `Line Item` INT,
    `Order Date` DATE,
    `CustomerKey` INT,
    `StoreKey` INT,
    `ProductKey` INT,
    `Quantity` INT,
    `Currency Code` VARCHAR(10)
);
'''
cursor.execute(create_table_query)

# Insert data from DataFrame into the table
for index, row in data_df.iterrows():
    cursor.execute(
        "INSERT INTO sales1 (`Order Number`, `Line Item`, `Order Date`, `CustomerKey`, `StoreKey`, `ProductKey`, `Quantity`, `Currency Code`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)",
        (row['Order Number'], row['Line Item'], row['Order Date'], row['CustomerKey'], row['StoreKey'], row['ProductKey'], row['Quantity'], row['Currency Code'])
    )
# Commit the transaction
conn.commit()

# Close the connection
cursor.close()
conn.close()

Connecting the excel file into an SQL file for(Products_processed)

In [14]:
import mysql.connector
import pandas as pd
import numpy as np

# Load data (adjust the file path and name as needed)
data_df = pd.read_excel('Products_processed.xlsx')

# Replace NaN values with None to insert NULLs in the database
data_df = data_df.replace({np.nan: None})

# MySQL connection details
conn = mysql.connector.connect(
    host='127.0.0.1',
    user='root',
    password='Abdul@1973',
    database='Dataspark'  # Use the correct database name
)
cursor = conn.cursor()

# Create the table with backticks for column names with spaces
create_table_query = '''
CREATE TABLE IF NOT EXISTS products1(
    `ProductKey` INT,
    `Product Name` VARCHAR(255),
    `Brand` VARCHAR(255),
    `Color` VARCHAR(50),
    `Unit Cost USD` DECIMAL(10, 2),
    `Unit Price USD` DECIMAL(10, 2),
    `SubcategoryKey` INT,
    `Subcategory` VARCHAR(255),
    `CategoryKey` INT,
    `Category` VARCHAR(255)
);
'''
cursor.execute(create_table_query)

# Insert data from DataFrame into the table
for index, row in data_df.iterrows():
    cursor.execute(
        "INSERT INTO products1 (`ProductKey`, `Product Name`, `Brand`, `Color`, `Unit Cost USD`, `Unit Price USD`, `SubcategoryKey`, `Subcategory`, `CategoryKey`, `Category`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)",
        (row['ProductKey'], row['Product Name'], row['Brand'], row['Color'], row['Unit Cost USD'], row['Unit Price USD'], row['SubcategoryKey'], row['Subcategory'], row['CategoryKey'], row['Category'])
    )

# Commit the transaction
conn.commit()

# Close the connection
cursor.close()
conn.close()

Connecting the excel file into an SQL file for(Stores_processed)

In [15]:
import mysql.connector


# Load data (adjust the file path and name as needed)
data_df = pd.read_excel('Stores_processed.xlsx')



# MySQL connection details
conn = mysql.connector.connect(
    host='127.0.0.1',
    user='root',
    password='Abdul@1973',
    database='Dataspark'  # Use the correct database name
)
cursor = conn.cursor()

# Create the table with backticks for column names with spaces
create_table_query = '''
CREATE TABLE IF NOT EXISTS stores1(
    `StoreKey` INT,
    `Country` VARCHAR(100),
    `State` VARCHAR(100),
    `Square Meters` FLOAT,
    `Open Date` DATE
);
'''
cursor.execute(create_table_query)

# Insert data from DataFrame into the table
for index, row in data_df.iterrows():
    cursor.execute(
        "INSERT INTO stores1(`StoreKey`, `Country`, `State`, `Square Meters`, `Open Date`) VALUES (%s, %s, %s, %s, %s)",
        (row['StoreKey'], row['Country'], row['State'], row['Square Meters'], row['Open Date'])
    )

# Commit the transaction
conn.commit()

# Close the connection
cursor.close()
conn.close()

Connecting the excel file into an SQL file for(Exchange_Rates_processed)

In [17]:
import mysql.connector


# Load data (adjust the file path and name as needed)
data_df = pd.read_excel('Exchange_Rates_processed.xlsx')



# MySQL connection details
conn = mysql.connector.connect(
    host='127.0.0.1',
    user='root',
    password='Abdul@1973',
    database='Dataspark'  # Use the correct database name
)
cursor = conn.cursor()

# Create the table with backticks for column names with spaces
create_table_query = '''
CREATE TABLE IF NOT EXISTS exchange1(
    `Date` DATE,
    `Currency` VARCHAR(50),
    `Exchange` DECIMAL(10, 4)
);
'''
cursor.execute(create_table_query)

# Insert data from DataFrame into the table
for index, row in data_df.iterrows():
    cursor.execute(
        "INSERT INTO exchange1( `Date`, `Currency`, `Exchange`) VALUES (%s, %s, %s)",
        (row['Date'], row['Currency'], row['Exchange'])
    )

# Commit the transaction
conn.commit()

# Close the connection
cursor.close()
conn.close()

Connecting the excel file into an SQL file for(Customers_Processed)

In [16]:
import mysql.connector
import pandas as pd
import numpy as np

# Load data (adjust the file path and name as needed)
data_df = pd.read_excel('Customers_processed.xlsx')


# MySQL connection details
conn = mysql.connector.connect(
    host='127.0.0.1',
    user='root',
    password='Abdul@1973',
    database='Dataspark'  # Use the correct database name
)
cursor = conn.cursor()

# Create the table with backticks for column names with spaces
create_table_query = '''
CREATE TABLE IF NOT EXISTS customers1(
    `CustomerKey` INT,
    `Gender` VARCHAR(10),
    `Name` VARCHAR(255),
    `City` VARCHAR(100),
    `State Code` VARCHAR(100),  -- Increased length here
    `State` VARCHAR(100),
    `Zip Code` VARCHAR(10),
    `Country` VARCHAR(100),
    `Continent` VARCHAR(100),
    `Birthday` DATE
);
'''

cursor.execute(create_table_query)

# Insert data from DataFrame into the table
for index, row in data_df.iterrows():
    cursor.execute(
        "INSERT INTO customers1( `CustomerKey`, `Gender`, `Name`, `City`, `State Code`, `State`, `Zip Code`, `Country`, `Continent`, `Birthday`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)",
        (row['CustomerKey'], row['Gender'], row['Name'], row['City'],
         row['State Code'], row['State'], row['Zip Code'],
         row['Country'], row['Continent'], row['Birthday'])
    )

# Commit the transaction
conn.commit()

# Close the connection
cursor.close()
conn.close()